driver-tests/bpelse/dynamicpartnerlink/correlation/correlationJbi/test/results/TestInvokeCorrelation/Actual_20130311140957_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <rec:item xmlns:rec="http://stc.com/ReceiveReply" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <rec:value>HELLO</rec:value>
    </rec:item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>