driver-tests/bpelse/correlation/correlationJBI/test/TestInvokeCorrelation/Input1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rec="http://stc.com/ReceiveReply">
  <soapenv:Body>
    <rec:item>
      <rec:value>HELLO</rec:value>
    </rec:item>
  </soapenv:Body>
</soapenv:Envelope>